In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":["Arpit", "Rohan", "Skillf", "Shubh"],
    "marks":[92,34,24,17],
    "city":["Kanpur","Kolkata","Bareilly","Antarctica"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks        city
0   Arpit     92      Kanpur
1   Rohan     34     Kolkata
2  Skillf     24    Bareilly
3   Shubh     17  Antarctica

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index = False)

In [7]:
df.head(2)

    name  marks     city
0  Arpit     92   Kanpur
1  Rohan     34  Kolkata

In [8]:
df.tail(2)

     name  marks        city
2  Skillf     24    Bareilly
3   Shubh     17  Antarctica

In [9]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
arpit = pd.read_csv('arpit.csv')
arpit

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Train No.,Speed,City
0,0,0,0,0,0,12322,50,Kanpur
1,1,1,1,1,1,12534,123,Kolkata
2,2,2,2,2,2,125654,67,Bareilly
3,3,3,3,3,3,564523,87,Antarctica

In [11]:
arpit['Speed'][0]=50
arpit

C:\Users\Dell\AppData\Local\Temp/ipykernel_13084/2238107010.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  arpit['Speed'][0]=50

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Train No.,Speed,City
0,0,0,0,0,0,12322,50,Kanpur
1,1,1,1,1,1,12534,123,Kolkata
2,2,2,2,2,2,125654,67,Bareilly
3,3,3,3,3,3,564523,87,Antarctica

In [12]:
arpit.to_csv('arpit.csv')

In [13]:
arpit.index = ['1st','2nd','3rd','4th']
arpit

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Train No.,Speed,City
1st,0,0,0,0,0,12322,50,Kanpur
2nd,1,1,1,1,1,12534,123,Kolkata
3rd,2,2,2,2,2,125654,67,Bareilly
4th,3,3,3,3,3,564523,87,Antarctica

In [14]:
ser = pd.Series(np.random.rand(10))
ser

0    0.666522
1    0.297030
2    0.172670
3    0.590476
4    0.187860
5    0.938777
6    0.562331
7    0.238152
8    0.913112
9    0.870851
dtype: float64

In [15]:
newdf =  pd.DataFrame(np.random.rand(334,5),index = np.arange(334))
newdf.head(5)

          0         1         2         3         4
0  0.400293  0.450386  0.022254  0.163178  0.355039
1  0.836433  0.744289  0.411682  0.602689  0.829681
2  0.285059  0.691615  0.441539  0.797178  0.393300
3  0.221557  0.098967  0.001139  0.229372  0.938062
4  0.882057  0.527276  0.194633  0.684752  0.865243

In [16]:
type(newdf)

pandas.core.frame.DataFrame

In [17]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [18]:
newdf[0][0] = 'arpit'
newdf

            0         1         2         3         4
0       arpit  0.450386  0.022254  0.163178  0.355039
1    0.836433  0.744289  0.411682  0.602689  0.829681
2    0.285059  0.691615  0.441539  0.797178  0.393300
3    0.221557  0.098967  0.001139  0.229372  0.938062
4    0.882057  0.527276  0.194633  0.684752  0.865243
..        ...       ...       ...       ...       ...
329    0.3411  0.035466  0.932812  0.847581  0.473691
330  0.150812  0.375594  0.181497  0.574786  0.968839
331  0.578659  0.506763  0.814301  0.991126  0.990056
332  0.850207  0.027418  0.326185  0.957844  0.197288
333  0.786411  0.788574  0.711164  0.088737  0.028369

[334 rows x 5 columns]

In [19]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [20]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [21]:
newdf.to_numpy()

array([['arpit', 0.45038585140177567, 0.0222541914742016,
        0.16317755826774127, 0.3550394575192052],
       [0.8364328509482264, 0.7442894411033525, 0.4116819410454131,
        0.6026891217484978, 0.8296809001743235],
       [0.285058592029091, 0.6916153541158885, 0.4415394579047166,
        0.7971779309688191, 0.393299830481473],
       ...,
       [0.5786594092031665, 0.5067634229729291, 0.814300706386738,
        0.9911263016190781, 0.990055786074344],
       [0.8502070290492066, 0.027417852549471378, 0.3261851436371588,
        0.9578444346995827, 0.19728769876240948],
       [0.7864107255636336, 0.7885735801812421, 0.7111641705443293,
        0.08873730439341021, 0.02836879003537862]], dtype=object)

In [22]:
newdf[0][0]=0.3

In [23]:
newdf.head()

          0         1         2         3         4
0       0.3  0.450386  0.022254  0.163178  0.355039
1  0.836433  0.744289  0.411682  0.602689  0.829681
2  0.285059  0.691615  0.441539  0.797178  0.393300
3  0.221557  0.098967  0.001139  0.229372  0.938062
4  0.882057  0.527276  0.194633  0.684752  0.865243

In [24]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.836433,0.285059,0.221557,0.882057,0.325322,0.990625,0.188223,0.886052,0.487581,...,0.794928,0.080997,0.693668,0.26801,0.999233,0.3411,0.150812,0.578659,0.850207,0.786411
1,0.450386,0.744289,0.691615,0.098967,0.527276,0.235859,0.241654,0.7285,0.497803,0.098574,...,0.226649,0.071645,0.627593,0.034604,0.915547,0.035466,0.375594,0.506763,0.027418,0.788574
2,0.022254,0.411682,0.441539,0.001139,0.194633,0.239934,0.402568,0.640194,0.165914,0.79982,...,0.120208,0.717562,0.483342,0.455931,0.931705,0.932812,0.181497,0.814301,0.326185,0.711164
3,0.163178,0.602689,0.797178,0.229372,0.684752,0.90442,0.426056,0.894698,0.572165,0.70853,...,0.447085,0.534723,0.59879,0.787075,0.172299,0.847581,0.574786,0.991126,0.957844,0.088737
4,0.355039,0.829681,0.3933,0.938062,0.865243,0.645928,0.027429,0.100245,0.692114,0.712981,...,0.489037,0.854181,0.203705,0.797674,0.789855,0.473691,0.968839,0.990056,0.197288,0.028369

In [25]:
newdf.sort_index(axis=0, ascending=False).head()

            0         1         2         3         4
333  0.786411  0.788574  0.711164  0.088737  0.028369
332  0.850207  0.027418  0.326185  0.957844  0.197288
331  0.578659  0.506763  0.814301  0.991126  0.990056
330  0.150812  0.375594  0.181497  0.574786  0.968839
329    0.3411  0.035466  0.932812  0.847581  0.473691

In [26]:
type(newdf[0])

pandas.core.series.Series

In [27]:
newdf2=newdf

In [28]:
newdf2[0][0]=97835

In [29]:
newdf

            0         1         2         3         4
0       97835  0.450386  0.022254  0.163178  0.355039
1    0.836433  0.744289  0.411682  0.602689  0.829681
2    0.285059  0.691615  0.441539  0.797178  0.393300
3    0.221557  0.098967  0.001139  0.229372  0.938062
4    0.882057  0.527276  0.194633  0.684752  0.865243
..        ...       ...       ...       ...       ...
329    0.3411  0.035466  0.932812  0.847581  0.473691
330  0.150812  0.375594  0.181497  0.574786  0.968839
331  0.578659  0.506763  0.814301  0.991126  0.990056
332  0.850207  0.027418  0.326185  0.957844  0.197288
333  0.786411  0.788574  0.711164  0.088737  0.028369

[334 rows x 5 columns]

In [30]:
newdf2=newdf.copy

In [31]:
newdf.loc[[1,2],[2,4]]

          2         4
1  0.411682  0.829681
2  0.441539  0.393300

In [32]:
newdf.loc[[1,2],:]

          0         1         2         3         4
1  0.836433  0.744289  0.411682  0.602689  0.829681
2  0.285059  0.691615  0.441539  0.797178  0.393300

In [33]:
newdf.loc[:,[2,4]]

            2         4
0    0.022254  0.355039
1    0.411682  0.829681
2    0.441539  0.393300
3    0.001139  0.938062
4    0.194633  0.865243
..        ...       ...
329  0.932812  0.473691
330  0.181497  0.968839
331  0.814301  0.990056
332  0.326185  0.197288
333  0.711164  0.028369

[334 rows x 2 columns]

In [34]:
newdf.loc[newdf[0]<0.3]

            0         1         2         3         4
2    0.285059  0.691615  0.441539  0.797178  0.393300
3    0.221557  0.098967  0.001139  0.229372  0.938062
7    0.188223  0.728500  0.640194  0.894698  0.100245
12   0.232557  0.127372  0.423760  0.213341  0.963750
16   0.204432  0.017054  0.176312  0.500843  0.243248
..        ...       ...       ...       ...       ...
308  0.117481  0.595421  0.384060  0.292637  0.630269
312  0.292627  0.586786  0.150867  0.369159  0.728102
325  0.080997  0.071645  0.717562  0.534723  0.854181
327   0.26801  0.034604  0.455931  0.787075  0.797674
330  0.150812  0.375594  0.181497  0.574786  0.968839

[87 rows x 5 columns]

In [35]:
newdf.loc[(newdf[0]<0.3) & (newdf[3]>0.1)]

            0         1         2         3         4
2    0.285059  0.691615  0.441539  0.797178  0.393300
3    0.221557  0.098967  0.001139  0.229372  0.938062
7    0.188223  0.728500  0.640194  0.894698  0.100245
12   0.232557  0.127372  0.423760  0.213341  0.963750
16   0.204432  0.017054  0.176312  0.500843  0.243248
..        ...       ...       ...       ...       ...
308  0.117481  0.595421  0.384060  0.292637  0.630269
312  0.292627  0.586786  0.150867  0.369159  0.728102
325  0.080997  0.071645  0.717562  0.534723  0.854181
327   0.26801  0.034604  0.455931  0.787075  0.797674
330  0.150812  0.375594  0.181497  0.574786  0.968839

[77 rows x 5 columns]

In [36]:
newdf.head()

          0         1         2         3         4
0     97835  0.450386  0.022254  0.163178  0.355039
1  0.836433  0.744289  0.411682  0.602689  0.829681
2  0.285059  0.691615  0.441539  0.797178  0.393300
3  0.221557  0.098967  0.001139  0.229372  0.938062
4  0.882057  0.527276  0.194633  0.684752  0.865243

In [37]:
newdf.iloc[0,4]

0.3550394575192052

In [38]:
newdf.iloc[[1,2],[2,4]]

          2         4
1  0.411682  0.829681
2  0.441539  0.393300

In [39]:
newdf.head(3)

          0         1         2         3         4
0     97835  0.450386  0.022254  0.163178  0.355039
1  0.836433  0.744289  0.411682  0.602689  0.829681
2  0.285059  0.691615  0.441539  0.797178  0.393300

In [40]:
newdf.drop([1])

            0         1         2         3         4
0       97835  0.450386  0.022254  0.163178  0.355039
2    0.285059  0.691615  0.441539  0.797178  0.393300
3    0.221557  0.098967  0.001139  0.229372  0.938062
4    0.882057  0.527276  0.194633  0.684752  0.865243
5    0.325322  0.235859  0.239934  0.904420  0.645928
..        ...       ...       ...       ...       ...
329    0.3411  0.035466  0.932812  0.847581  0.473691
330  0.150812  0.375594  0.181497  0.574786  0.968839
331  0.578659  0.506763  0.814301  0.991126  0.990056
332  0.850207  0.027418  0.326185  0.957844  0.197288
333  0.786411  0.788574  0.711164  0.088737  0.028369

[333 rows x 5 columns]

In [41]:
newdf.drop([1,3],axis = 1)

            0         2         4
0       97835  0.022254  0.355039
1    0.836433  0.411682  0.829681
2    0.285059  0.441539  0.393300
3    0.221557  0.001139  0.938062
4    0.882057  0.194633  0.865243
..        ...       ...       ...
329    0.3411  0.932812  0.473691
330  0.150812  0.181497  0.968839
331  0.578659  0.814301  0.990056
332  0.850207  0.326185  0.197288
333  0.786411  0.711164  0.028369

[334 rows x 3 columns]

In [42]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile','Bullwhip'],
                   "born": [pd.NaT, pd. Timestamp ("1940-04-25"),pd.NaT]})
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [43]:
df.dropna(how = 'all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [44]:
 df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, np.nan, np.nan],
                   "born": [pd.NaT, pd. Timestamp ("1940-04-25"),pd.NaT]})
df.head()

       name  toy       born
0    Alfred  NaN        NaT
1    Batman  NaN 1940-04-25
2  Catwoman  NaN        NaT

In [45]:
df.dropna(how='all', axis=1)

       name       born
0    Alfred        NaT
1    Batman 1940-04-25
2  Catwoman        NaT

In [46]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile','Bullwhip'],
                   "born": [pd.NaT, pd. Timestamp ("1940-04-25"),pd.NaT]})
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [47]:
df.dropna(how='all', axis=1)

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [48]:
df.drop_duplicates(subset=['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [49]:
df.drop_duplicates(subset=['name'], keep='first')

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [50]:
 df.drop_duplicates(subset=['name'], keep='last')

     name        toy       born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [51]:
df.drop_duplicates(subset=['name'], keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [52]:
df.shape

(3, 3)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [54]:
df['name'].value_counts

<bound method IndexOpsMixin.value_counts of 0    Alfred
1    Batman
2    Alfred
Name: name, dtype: object>

In [55]:
df['name'].value_counts(dropna=False)

Alfred    2
Batman    1
Name: name, dtype: int64

In [56]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [57]:
# create a dataframe which contains only integers with 3 rows and 2 columns

In [58]:
dict1 = {
    "name":["Arpit", "Rohan", "Skillf", "Shubh"],
    "marks":[92,34,24,17],
    "city":["Kanpur","Kolkata","Bareilly","Antarctica"]
}

In [59]:
dict1

{'name': ['Arpit', 'Rohan', 'Skillf', 'Shubh'],
 'marks': [92, 34, 24, 17],
 'city': ['Kanpur', 'Kolkata', 'Bareilly', 'Antarctica']}

In [60]:
arr = pd.Series(np.random.rand(10))
arr

0    0.500446
1    0.099541
2    0.892494
3    0.364049
4    0.099760
5    0.301080
6    0.804007
7    0.911416
8    0.433096
9    0.244238
dtype: float64

In [61]:
arr.describe()

count    10.000000
mean      0.465013
std       0.307679
min       0.099541
25%       0.258449
50%       0.398572
75%       0.728117
max       0.911416
dtype: float64

In [62]:
arr.mean()

0.4650126574817814

In [63]:
arr.count()

10

In [64]:
arr.max()

0.9114160275087593

In [65]:
arr.min()

0.09954112635606704

In [66]:
arr.median()

0.3985721106872607

In [67]:
arr.std()

0.30767882933537527

In [68]:
arr.corr

<bound method Series.corr of 0    0.500446
1    0.099541
2    0.892494
3    0.364049
4    0.099760
5    0.301080
6    0.804007
7    0.911416
8    0.433096
9    0.244238
dtype: float64>